In [1]:
import pandas as pd

In [2]:
date_list = [{'yyyy-mm-dd': '2000-06-27'},
         {'yyyy-mm-dd': '2002-09-24'},
         {'yyyy-mm-dd': '2005-12-20'}]
df = pd.DataFrame(date_list, columns = ['yyyy-mm-dd'])

In [3]:
df

   yyyy-mm-dd
0  2000-06-27
1  2002-09-24
2  2005-12-20

In [4]:
def extract_year(column):
    return column.split('-')[0]

In [6]:
df['year'] = df['yyyy-mm-dd'].apply(extract_year)

In [7]:
df

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2002-09-24  2002
2  2005-12-20  2005

In [8]:
def get_age(year,current_year):
    return current_year - int(year)

In [10]:
# year 인수는 데이터 프레임에 있고, current_year 인수는 새로 받는다.
df['age'] = df['year'].apply(get_age,current_year=2018)

In [11]:
df

   yyyy-mm-dd  year  age
0  2000-06-27  2000   18
1  2002-09-24  2002   16
2  2005-12-20  2005   13

In [12]:
def get_introduce(age,prefix,suffix): # 여러 인수를 받는 경우
    return prefix+str(age)+suffix

In [13]:
df['introduce'] = df['age'].apply(get_introduce,prefix = 'I am',suffix='years old')

In [14]:
df

   yyyy-mm-dd  year  age        introduce
0  2000-06-27  2000   18  I am18years old
1  2002-09-24  2002   16  I am16years old
2  2005-12-20  2005   13  I am13years old

In [18]:
def get_introdice_2(row): # 여러 개의 인수를 여러 컬럼으로 받고 싶을때
    return 'I was born in' + str(row.year) + 'my age is' + str(row.age)

In [22]:
df['introduce'] = df.apply(get_introdice_2,axis = 1)

In [20]:
df

   yyyy-mm-dd  year  age                     introduce
0  2000-06-27  2000   18  I was born in2000my age is18
1  2002-09-24  2002   16  I was born in2002my age is16
2  2005-12-20  2005   13  I was born in2005my age is13